EDT/УТ/src/Reports/новаПутевойЛист_4С/новаПутевойЛист_4С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>новаПутевойЛист_4С</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>BusinessProcessObject.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
</mdclass:Report>

EDT/УТ/src/Catalogs/новаДокументыВодителей/новаДокументыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаДокументыВодителей</name>
  <owners>Catalog.новаВодители</owners>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.новаВидыДокументовВодителей</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СканыДокументов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Reports/новаПутевойЛист_4С/ObjectModule.bsl
// Предопределенное свойство. Содержит коллекцию свойств печатной формы.
//
Перем СвойстваПечатнойФормы Экспорт; // <Структура>

// Предопределенная функция. Формирует печатную форму в указанном документе.
//
// Параметры:
//  Форма             <Форма>
//  ТабличныйДокумент <ТабличныйДокумент>
//  Заголовок         <Строка>
//
// Возвращаемое значение:
//  <Булево>: Истина, если печатную форму удалось сформировать.
//
Функция ВывестиНаПечать(Форма, ТабличныйДокумент, Заголовок) Экспорт
	
	Если ТипЗнч(Форма) = Тип("Форма") Тогда
		ИсточникМаршрута = Форма.ИсточникМаршрута;
	Иначе
		ИсточникМаршрута = Обработки.новаИсточникМаршрутРейса.Создать();
		ИсточникМаршрута.НачатьРедактирование(Форма.Ссылка, Форма.ЭтотОбъект);
	КонецЕсли;
	
	Заголовок = СокрЛП(Форма.Ссылка) + " - Путевой лист 4С";
	
	Макет = ПолучитьМакет("ПутевойЛист4С");
	
	Лицевая = Макет.ПолучитьОбласть("Лицевая");
	Лицевая.Параметры.Номер = Владелец.ПутевойЛист.Номер;
	Лицевая.Параметры.ДатаВыписки = Формат(Владелец.ПутевойЛист.Дата, "ДЛФ=DD");
	Лицевая.Параметры.Организация = Владелец.ПутевойЛист.Организация;
	Лицевая.Параметры.РежимРаботы = Владелец.ПутевойЛист.РежимРаботы;
	Лицевая.Параметры.МодельТС    = Владелец.Транспорт.Марка;
	Лицевая.Параметры.ТранспортноеСредствоГосНомер = Владелец.Транспорт.НомерГосударственнойРегистрации;
	Лицевая.Параметры.ТранспортноеСредствоГарНомер = Владелец.Транспорт.ГаражныйНомер;
	Лицевая.Параметры.Водители   = Владелец.Водитель;
	Лицевая.Параметры.ВодительКод = Владелец.Водитель.ТабельныйНомер;
	Выборка = Справочники.новаДокументыВодителей.Выбрать(,Владелец.Водитель);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДокумента = Справочники.новаВидыДокументовВодителей.ВодительскоеУдостоверение Тогда
			Лицевая.Параметры.НомерУдостоверенияВодителя   = Выборка.Номер;
		КонецЕсли;
	КонецЦикла; 
	Лицевая.Параметры.КлассВодителя = Владелец.Водитель.Класс;
	Лицевая.Параметры.ЛицензионнаяКарточка = "";
	Лицевая.Параметры.НомерЛицензионнойКарточки = "";
	Лицевая.Параметры.СерияЛицензионнойКарточки = "";
	//Лицевая.Параметры.Водитель2   = "";
	//Лицевая.Параметры.ВодительКод2 = "";
	Лицевая.Параметры.ПрицепМодель1 = Владелец.ПутевойЛист.Прицеп1.Марка;
	Лицевая.Параметры.ПрицепГосНомер1 = Владелец.ПутевойЛист.Прицеп1.НомерГосударственнойРегистрации;
	Лицевая.Параметры.ПрицепГарНомер1 = Владелец.ПутевойЛист.Прицеп1.ГаражныйНомер;
	Лицевая.Параметры.ПрицепМодель2 = Владелец.ПутевойЛист.Прицеп2.Марка;
	Лицевая.Параметры.ПрицепГосНомер2 = Владелец.ПутевойЛист.Прицеп2.НомерГосударственнойРегистрации;
	Лицевая.Параметры.ПрицепГарНомер2 = Владелец.ПутевойЛист.Прицеп2.ГаражныйНомер;
	Лицевая.Параметры.ПрицепМодель3 = Владелец.ПутевойЛист.Прицеп3.Марка;
	Лицевая.Параметры.ПрицепГосНомер3 = Владелец.ПутевойЛист.Прицеп3.НомерГосударственнойРегистрации;
	Лицевая.Параметры.ПрицепГарНомер3 = Владелец.ПутевойЛист.Прицеп3.ГаражныйНомер;
	//Лицевая.Параметры.ПрицепМодель4 = "";
	//Лицевая.Параметры.ПрицепГосНомер4 = "";
	//Лицевая.Параметры.ПрицепГарНомер4 = "";
	ДатаВыезда = Владелец.ДатаНачала;
	Лицевая.Параметры.ДатаВыезда_ДД = День(ДатаВыезда);
	Лицевая.Параметры.ДатаВыезда_ММММ = Месяц(ДатаВыезда);
	Лицевая.Параметры.ВремяВыезда_ЧЧ = Час(ДатаВыезда);
	Лицевая.Параметры.ВремяВыезда_ММ = Минута(ДатаВыезда);
	Лицевая.Параметры.СпидометрВыезда = Владелец.ПутевойЛист.СпидометрВыезда;
	Лицевая.Параметры.ГСМ1 = Владелец.ПутевойЛист.ГСМ1;
	Лицевая.Параметры.ОстатокПриВыезде1 = Владелец.ПутевойЛист.ОстатокПриВыезде1;
	Лицевая.Параметры.ГСМ2 = Владелец.ПутевойЛист.ГСМ2;
	Лицевая.Параметры.ОстатокПриВыезде2 = Владелец.ПутевойЛист.ОстатокПриВыезде2;
	//ИтогоКоличество = 0;
	//ИтогоРасстояние = 0;
	ИтогоВес = 0;
	ТекИндекс = 0;
	мсЗадания = ИсточникМаршрута.ПолучитьДоставкиВПорядкеВыполнения(Форма.Ссылка);
	Для Каждого Задание Из мсЗадания Цикл
		//Если НЕ СтрокаМаршрута.ТочкаМаршрута = СтрокаМаршрута.Задание.ТочкаПрибытия Тогда
		//	Продолжить;
		//КонецЕсли;
		ТекИндекс = ТекИндекс + 1;
		Если ТекИндекс > 5 Тогда
			Прервать;
		КонецЕсли;
		Лицевая.Параметры["Заказчик"+Строка(ТекИндекс)] = Задание.Грузополучатель;
		Лицевая.Параметры["ВремяПрибытия"+Строка(ТекИндекс)] = Формат(Задание.ВремяПрибытияС, "ДФ='dd.ММ.yy ЧЧ.мм'");
		Лицевая.Параметры["АдресПогрузки"+Строка(ТекИндекс)] = Задание.ТочкаОтправления.Адрес;
		Лицевая.Параметры["АдресРазгрузки"+Строка(ТекИндекс)] = Задание.ТочкаПрибытия.Адрес;
		Лицевая.Параметры["Груз"+Строка(ТекИндекс)] = Задание.Груз.Описание;
		Лицевая.Параметры["Количество"+Строка(ТекИндекс)] = "";
		Лицевая.Параметры["Расстояние"+Строка(ТекИндекс)] = "";
		Лицевая.Параметры["Вес"+Строка(ТекИндекс)] = Задание.Груз.Вес;
		//ИтогоКоличество = ИтогоКоличество + ;
		//ИтогоРасстояние = ИтогоРасстояние + ;
		ИтогоВес = ИтогоВес + Задание.Груз.Вес;
	КонецЦикла;
	
	Ответственные = новаУправлениеТранспортнойЛогистикой.ПолучитьОтветственныхЛиц(Владелец.ПутевойЛист.Организация, Владелец.ПутевойЛист.Дата);
	//Лицевая.Параметры.ИтогоКоличество = "";
	//Лицевая.Параметры.ИтогоРасстояние = "";
	Лицевая.Параметры.ИтогоВес = ИтогоВес;
	Лицевая.Параметры.ВыдатьКоличествоГорючего = Владелец.ПутевойЛист.ВыдатьКоличествоГорючего;
	Лицевая.Параметры.ВыдатьГорючее = Владелец.ПутевойЛист.ВыдатьГорючее;
	Лицевая.Параметры.ВыпустилМеханик = Ответственные.ОсновнойМеханик;
	Лицевая.Параметры.ВыдалДиспетчер = Ответственные.ОсновнойДиспетчер;
	Лицевая.Параметры.ВодительПринял = Владелец.Водитель;
	Лицевая.Параметры.ВодительСдал = Владелец.Водитель;
	Лицевая.Параметры.ПринялМеханик = Ответственные.ОсновнойМеханик;
	Лицевая.Параметры.ОсмотрелВрач = Ответственные.ОсновнойВрач;
	//Лицевая.Параметры.НомерПЛВТалоне = "";
	//Лицевая.Параметры.ДатаПЛВТалоне = "";
	ТабличныйДокумент.Вывести(Лицевая);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Оборотная = Макет.ПолучитьОбласть("Оборотная");
	ТабличныйДокумент.Вывести(Оборотная);
	
	// Зададим параметры макета
	ТабличныйДокумент.ПолеСверху              = 0;
	ТабличныйДокумент.ПолеСлева               = 0;
	ТабличныйДокумент.ПолеСнизу               = 0;
	ТабличныйДокумент.ПолеСправа              = 0;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу  = 0;
	ТабличныйДокумент.АвтоМасштаб             = Истина;
	ТабличныйДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечатиПутевогоЛиста4С";
	
	Возврат Истина;
КонецФункции

СвойстваПечатнойФормы = Новый Структура("Представление", "Путевой лист 4С");
